espressif/esp-idf/components/soc/esp32s2/include/soc/usbh_struct.h
typedef union {
    struct {
        uint32_t sched_info: 8;
        uint32_t ntd: 8;
        uint32_t reserved3: 3;
        uint32_t reserved10: 10;
        uint32_t pid: 2;
        uint32_t dopng: 1;
    };
    uint32_t val;
    //Checked
} usb_hctsiz_reg_t;

typedef union {
    struct {
        uint32_t reserved3: 3;
        uint32_t ctd: 6;
        uint32_t dmaaddr: 23;
    } non_iso;
    struct {
        uint32_t reserved3: 3;
        uint32_t dmaaddr_ctd: 29;
    } iso;
    uint32_t val;
    //Checked
} usb_hcdma_reg_t;

typedef union {
    struct {
        uint32_t hcdmab;
    };
    uint32_t val;
} usb_hcdmab_reg_t;

typedef union {
    struct {
        uint32_t reserved2a: 2;
        uint32_t nzstsouthshk: 1;
        uint32_t reserved1: 1;
        uint32_t devaddr: 7;
        uint32_t perfrlint: 2;
        uint32_t endevoutnak: 1;
        uint32_t xcvrdly: 1;
        uint32_t erraticintmsk: 1;
        uint32_t reserved2b: 2;
        uint32_t epmiscnt: 5;
        uint32_t descdma: 1;
        uint32_t perschintvl: 2;
        uint32_t resvalid: 6;
    };
    uint32_t val;
} usb_dcfg_reg_t;

typedef union {
    struct {
        uint32_t rmtwkupsig: 1;
        uint32_t sftdiscon: 1;
        uint32_t gnpinnaksts: 1;
        uint32_t goutnaksts: 1;
        uint32_t tstctl: 3;
        uint32_t sgnpinnak: 1;
        uint32_t cgnpinnak: 1;
        uint32_t sgoutnak: 1;
        uint32_t cgoutnak: 1;
        uint32_t pwronprgdone: 1;
        uint32_t reserved1: 1;
        uint32_t gmc: 2;
        uint32_t ignrfrmnum: 1;
        uint32_t nakonbble: 1;
        uint32_t encountonbna: 1;
        uint32_t deepsleepbeslreject: 1;
        uint32_t reserved3: 13;
    };
    uint32_t val;
} usb_dctl_reg_t;

typedef union {
    struct {
        uint32_t suspsts: 1;
        uint32_t enumspd: 2;
        uint32_t errticerr: 1;
        uint32_t reserved4: 4;
        uint32_t soffn: 14;
        uint32_t devlnsts: 2;
        uint32_t reserved8: 8;
    };
    uint32_t val;
} usb_dsts_reg_t;

typedef union {
    struct {
        uint32_t di_xfercomplmsk: 1;
        uint32_t di_epdisbldmsk: 1;
        uint32_t di_ahbermsk: 1;
        uint32_t timeoutmsk: 1;
        uint32_t intkntxfempmsk: 1;
        uint32_t intknepmismsk: 1;
        uint32_t inepnakeffmsk: 1;
        uint32_t reserved1: 1;
        uint32_t txfifoundrnmsk: 1;
        uint32_t bnainintrmsk: 1;
        uint32_t reserved3: 3;
        uint32_t di_nakmsk: 1;
        uint32_t reserved18: 18;
    };
    uint32_t val;
} usb_diepmsk_reg_t;

typedef union {
    struct {
        uint32_t xfercomplmsk: 1;
        uint32_t epdisbldmsk: 1;
        uint32_t ahbermsk: 1;
        uint32_t setupmsk: 1;
        uint32_t outtknepdismsk: 1;
        uint32_t stsphsercvdmsk: 1;
        uint32_t back2backsetup: 1;
        uint32_t reserved1: 1;
        uint32_t outpkterrmsk: 1;
        uint32_t bnaoutintrmsk: 1;
        uint32_t reserved2: 2;
        uint32_t bbleerrmsk: 1;
        uint32_t nakmsk: 1;
        uint32_t nyetmsk: 1;
        uint32_t reserved17: 17;
    };
    uint32_t val;
} usb_doepmsk_reg_t;

typedef union {
    struct {
        uint32_t inepint0: 1;
        uint32_t inepint1: 1;
        uint32_t inepint2: 1;
        uint32_t inepint3: 1;
        uint32_t inepint4: 1;
        uint32_t inepint5: 1;
        uint32_t inepint6: 1;
        uint32_t reserved9a: 9;
        uint32_t outepint0: 1;
        uint32_t outepint1: 1;
        uint32_t outepint2: 1;
        uint32_t outepint3: 1;
        uint32_t outepint4: 1;
        uint32_t outepint5: 1;
        uint32_t outepint6: 1;
        uint32_t reserved9b: 9;
    };
    uint32_t val;
} usb_daint_reg_t;

typedef union {
    struct {
        uint32_t inepmsk0: 1;
        uint32_t inepmsk1: 1;
        uint32_t inepmsk2: 1;
        uint32_t inepmsk3: 1;
        uint32_t inepmsk4: 1;
        uint32_t inepmsk5: 1;
        uint32_t inepmsk6: 1;
        uint32_t reserved9a: 9;
        uint32_t outepmsk0: 1;
        uint32_t outepmsk1: 1;
        uint32_t outepmsk2: 1;
        uint32_t outepmsk3: 1;
        uint32_t outepmsk4: 1;
        uint32_t outepmsk5: 1;
        uint32_t outepmsk6: 1;
        uint32_t reserved9b: 9;
    };
    uint32_t val;
} usb_daintmsk_reg_t;

typedef union {
    struct {
        uint32_t dvbusdis: 16;
        uint32_t reserved16: 16;
    };
    uint32_t val;
} usb_dvbusdis_reg_t;

typedef union {
    struct {
        uint32_t dvbuspulse: 12;
        uint32_t reserved20: 20;
    };
    uint32_t val;
} usb_dvbuspulse_reg_t;

typedef union {
    struct {
        uint32_t nonisothren: 1;
        uint32_t isothren: 1;
        uint32_t txthrlen: 9;
        uint32_t ahbthrratio: 2;
        uint32_t reserved3: 3;
        uint32_t rxthren: 1;
        uint32_t rxthrlen: 9;
        uint32_t reserved1: 1;
        uint32_t arbprken: 1;
        uint32_t reserved4: 4;
    };
    uint32_t val;
} usb_dthrctl_reg_t;

typedef union {
    struct {
        uint32_t ineptxfernpmsk: 16;
        uint32_t reserved16: 16;
    };
    uint32_t val;
} usb_diepempmsk_reg_t;

typedef union {
    struct {
        uint32_t mps0: 2;
        uint32_t reserved9: 9;
        uint32_t reserved4: 4;
        uint32_t usbactep0: 1;
        uint32_t reserved1a: 1;
        uint32_t naksts0: 1;
        uint32_t eptype0: 2;
        uint32_t reserved1b: 1;
        uint32_t stall0: 1;
        uint32_t txfnum0: 4;
        uint32_t cnak0: 1;
        uint32_t snak0: 1;
        uint32_t reserved2: 2;
        uint32_t epdis0: 1;
        uint32_t epena0: 1;
    };
    uint32_t val;
} usb_diepctl0_reg_t;

typedef union {
    struct {
        uint32_t xfercompl0: 1;
        uint32_t epdisbld0: 1;
        uint32_t ahberr0: 1;
        uint32_t timeout0: 1;
        uint32_t intkntxfemp0: 1;
        uint32_t intknepmis0: 1;
        uint32_t inepnakeff0: 1;
        uint32_t txfemp0: 1;
        uint32_t txfifoundrn0: 1;
        uint32_t bnaintr0: 1;
        uint32_t reserved1: 1;
        uint32_t pktdrpsts0: 1;
        uint32_t bbleerr0: 1;
        uint32_t nakintrpt0: 1;
        uint32_t nyetintrpt0: 1;
        uint32_t reserved17: 17;
    };
    uint32_t val;
} usb_diepint0_reg_t;

